{


    
  "welcome.message": "مرحباً بك في Amarire Dev",



  "nav.home": "الرئيسية",
  "nav.projects": "مشاريعي",
  "nav.about": "عني",
  "nav.contact": "تواصل معي",
  "lang.en": "الإنجليزية",
  "lang.ar": "العربية",
  "lang.fr": "الفرنسية",
  "darkModeLabel": "تبديل الوضع الليلي",
  "main.welcomeTitle": "مرحبًا بك في Amarire Dev",
  "main.welcomeText": "نقوم بإنشاء مواقع حديثة ومتجاوبة تناسب احتياجاتك.",
  "main.servicesTitle": "خدماتنا",
  "main.services.webDevelopment": "تطوير المواقع",
  "main.services.wordpress": "مواقع ووردبريس",
  "main.services.ecommerce": "متاجر إلكترونية",
  "main.services.optimization": "تحسين الأداء وتهيئة محركات البحث",
  "main.aboutTitle": "من نحن",
  "main.aboutText": "Amarire Dev هو استوديو لتطوير الويب مكرّس لبناء مواقع سريعة وجميلة وعملية.",
  "main.contactTitle": "اتصل بنا",
  "main.contactText": "هل تحتاج إلى موقع؟",
  "main.contactLink": "تواصل معنا",




  "hero_greeting": "مرحباً، أنا",
  "hero_profession": "مطور ويب",
  "hero_description": "أنا مطور ويب متخصص في الواجهة الأمامية، أبدع في إنشاء مواقع متجاوبة وسهلة الاستخدام باستخدام تقنيات حديثة مثل HTML وCSS وJavaScript. أعمل على تقديم تجارب رقمية سلسة تلبي احتياجات العملاء وتتجاوز توقعاتهم.",
  "hero_button": "تواصل معي",




  
  
  "about_title": "نبذة عني",
  "about_paragraph_1": "أقوم بتطوير المواقع مع تركيز قوي على إنشاء تصاميم تجمع بين الجاذبية البصرية والوظائف العالية. يهدف منهجي إلى فهم الأهداف والمتطلبات الفريدة لكل عميل لتقديم حلول رقمية تعكس رؤيتهم بشكل حقيقي. خلال تجربتي، عملت على مجموعة واسعة من المشاريع مثل المتاجر الإلكترونية، المدونات، المواقع التجارية، وحقائب الأعمال الشخصية. أُعطي لكل مشروع نفس المستوى من الاهتمام لضمان أن المنتج النهائي لا يبدو جيدًا فقط، بل يوفر أيضًا تجربة تصفح سلسة ومرضية على جميع الأجهزة والمتصفحات.",
  "about_paragraph_2": "أستخدم في بناء المواقع مجموعة متنوعة من الأدوات والتقنيات مثل HTML، CSS، JavaScript، PHP، ومنصات شهيرة مثل WordPress وWooCommerce وShopify. تتيح لي هذه الأدوات التحكم في كل من واجهات المستخدم الأمامية والأنظمة الخلفية التي تضمن سير العمل بسلاسة. الكود الذي أكتبه منظم ونظيف وقابل للصيانة، مما يسهل تحديث الموقع وتطويره مع مرور الوقت لتلبية الاحتياجات المتغيرة. مع التركيز على الأداء، الأمان، والتوافق، أهدف إلى تقديم مواقع إلكترونية موثوقة وفعالة تضمن تجربة زائر سلسة دون انقطاع.",
  "about_paragraph_3": "الحفاظ على تواصل مفتوح وواضح مع العملاء هو جزء أساسي من عملي. أحرص على التعاون الوثيق في كل مرحلة من مراحل المشروع، من التخطيط الأولي إلى التسليم النهائي، وحتى بعد إطلاق الموقع. هذا الدعم المستمر يتيح تحسينات وتحديثات مستمرة تساعد في الحفاظ على فعالية الموقع وملاءمته. بالإضافة إلى ذلك، أخصص وقتًا لتعلم الاتجاهات والتقنيات الحديثة في تطوير الويب، مما يمكنني من دمج أحدث التطورات وأفضل الممارسات في عملي. الهدف النهائي هو مساعدة العملاء على بناء حضور قوي واحترافي على الإنترنت يدعم طموحاتهم وينمو مع أعمالهم.",



  "skills.title": "المهارات والأدوات",










  "projects.title": "مشاريعي المميزة",
  "projects.view": "عرض المشروع →",
  "projects.github": "GitHub",

  "projects.project1.title": "معرض أعمال شخصي",
  "projects.project1.desc": "محفظة مطور حديثة لعرض المهارات والتواصل والخدمات.",

  "projects.project2.title": "صفحة هبوط لشركة ناشئة",
  "projects.project2.desc": "صفحة هبوط بواجهات تفاعلية متجاوبة وتحريك سلس للشركات التقنية.",

  "projects.project3.title": "متجر إلكتروني",
  "projects.project3.desc": "قالب واجهة متجر إلكتروني كامل مع فلترة وسلة وتصميم متجاوب.",

  "projects.project4.title": "نظام تدوين",
  "projects.project4.desc": "مدونة بسيطة مع تصنيفات وبطاقات مقالات وإعداد ووردبريس مخصص.",

  "projects.project5.title": "تطبيق إدارة المهام",
  "projects.project5.desc": "تطبيق لإدارة المهام بواجهة أمامية مع أولويات، حالات، وفلترة.",

  "projects.project6.title": "نسخة من نتفليكس",
  "projects.project6.desc": "نسخة متجاوبة من الصفحة الرئيسية لنتفليكس مع شرائح وتصنيفات.",





  "testimonials.title": "ماذا يقول عملائي",
  "testimonials.text1": "كان من الرائع العمل مع Amarire. فهم تمامًا ما أحتاج إليه وسلّم العمل في الوقت المحدد. النتيجة كانت نظيفة واحترافية.",
  "testimonials.text2": "أنا سعيد جدًا بالموقع الذي أنشأه Amarire لمشروعي. يبدو رائعًا ويعمل بسلاسة. التواصل كان واضحًا وسهلًا طوال الوقت.",
  "testimonials.text3": "شخص موثوق وسريع الاستجابة. حتى عندما طلبت تغييرات بسيطة، تعامل معها بسرعة. أوصي به إذا كنت تبحث عن عمل عالي الجودة.",
  "testimonials.text4": "العملية كانت بسيطة، والنتيجة ممتازة. لم أكن أملك أي معرفة تقنية، لكن Amarire أرشدني خطوة بخطوة. الآن لدي موقع أفخر بمشاركته مع عملائي.",








"contact.title_part1": "تواصل",
"contact.title_part2": "معي",
"contact.subtitle": "دعني أتواصل معك وأحوّل أفكارك إلى واقع. إذا كان لديك سؤال أو مشروع، أنا هنا لمساعدتك!",
"contact.errors.name_required": "يرجى إدخال اسمك.",
"contact.errors.email_invalid": "يرجى إدخال بريد إلكتروني صالح.",
"contact.errors.subject_required": "يرجى إدخال الموضوع.",
"contact.errors.message_required": "يرجى إدخال رسالتك.",
  "contact.form.verify_and_send": "تحقق ثم أرسل",
"contact.errors.complete_captcha": "يرجى إكمال اختبار التحقق قبل الإرسال.",
"contact.form.submit": "أرسل رسالتك",
"contact.EmailTitle": "البريد الإلكتروني",
"contact.EmailDescription": "يمكنك إرسال رسالة في أي وقت عبر البريد الإلكتروني",
"contact.WhatsappTitle": "واتساب",
"contact.WhatsappDescription": "لا تتردد في التواصل عبر واتساب في أي وقت",
"contact.phone": "2502 242 77 212+",
"contact.TelegramTitle": "تيليجرام",
"contact.TelegramDescription": "لا تتردد في مراسلتي عبر تيليجرام في أي وقت",

  "contact.placeholders.name": "اسمك",
  "contact.placeholders.email": "بريدك الإلكتروني",
  "contact.placeholders.subject": "الموضوع",
  "contact.placeholders.message": "رسالتك",







  "footer.copyright": "© 2025 Amarire Dev - جميع الحقوق محفوظة."
}

